{
  "${ModID}:ProfessorOak": {
    "NAME": "Professor Oak",
    "DESCRIPTIONS": [
      "Oh, a new trainer about to start their journey?",
      "You look a bit old to be just starting out, but no matter. Here's some Pokeballs to get you started.",
      "Now choose a companion to begin your journey with.",
      "I hope you make many fond memories together."
    ],
    "OPTIONS": [
      "[Continue] ",
      "Receive Pokeballs ",
      "Choose a Starter Pokemon",
      "[Leave]"
    ]
  },
  "${ModID}:CeladonGym": {
    "NAME": "Celadon Gym",
    "DESCRIPTIONS": [
      "As you're walking through a #yrainbow-colored city, you suddenly hear the panicked cries of nearby people. NL \"Someone help! The gym is on #rfire!\" NL You find the building in question, and it is indeed very much on #rfire. You see that some #yPokemon are trapped inside - perhaps you could help? On the other hand, the #pcrisis has left the nearby storerooms unattended, and you ARE feeling awfully hungry . . .",
      "You let your conscience guide your actions, and with a heroic leap, you dive into the flames and come out with a few #rburns and a #rsinged #yPokemon in your arms. NL \"Gloom! You're safe!\" NL A woman in a kimono rushes up to you, and the #yPokemon in your arms jumps into hers. NL \"Thank you so much for saving Gloom. Here, take this #yRainbow #yBadge as thanks for your bravery.\" NL You slip the badge into your pocket and carry onward with your head held high.",
      "Inside the storeroom, you find a variety of delectable fruits. Although you feel slightly guilty over your actions, your survival was a far higher priority than keeping a clean conscience."
    ],
    "OPTIONS": [
      "[Rescue Pokemon] ",
      "[Steal some fruit] ",
      "Lose ",
      " HP.",
      "Obtain a Special Relic.",
      "Gain ",
      " Max HP.",
      "[Leave]"
    ]
  },
  "${ModID}:PokemonCenter": {
    "NAME": "Pokemon Center",
    "DESCRIPTIONS": [
      "You find yourself inside a large, crowded building with people constantly going in and out. A large welcome poster on the nearby wall indicates that this place is known as a \"Pokemon Center\" where your companions can have their strength #grestored. NL \"Excuse me, everyone!\" A nearby figure in a nurse's uniform called out. \"We're running a bit low on supplies. If anyone has any extras, we'd be happy to buy them off you!\" NL Although, a little extra #ycurrency in your pocket certainly wouldn't hurt either.",
      "You hand over one of your spare potions, and the nurse hands you some currency with a #ysmile on her face. NL \"Thank you very much! I'm sure someone will appreciate this very soon.\" NL You hope that you don't end up missing that potion very soon.",
      "You hand over your Pokeballs to one of the nurses at a counter, and you settle in for a long wait. NL After what feels like an eternity, your team is returned to you, and you continue on your #yjourney."
    ],
    "OPTIONS": [
      "[Sell excess supplies] ",
      "[Heal your Pokemon] ",
      "Lose ",
      ".",
      "Gain ",
      " Gold.",
      "Fully restore the Stamina of all your Pokemon.",
      "[Leave]",
      "[Locked] Requires: Potion"
    ]
  },
  "${ModID}:FuchsiaGym": {
    "NAME": "Fuchsia Gym",
    "DESCRIPTIONS": [
      "The mansion in front of you looks plain, unassuming - a casual eye would easily gloss over the building entirely. As you enter, a man wound as tight as a coil, like a #pserpent about to strike, greets you. NL \"A new challenger! You have a #rwarrior's look about you, unlike those other fresh-faced trainers.\" He grins at you. \"What say you to challenging my gym's #yobstacle #ycourse? I guarantee that both you and your #yPokemon will come out stronger on the other side!\" NL The man looks sincere, but you can't help but cast a #pdubious look around the room, wondering what exactly would be in store for you.",
      "\"A fine choice!\" The man declares. \"Now, brace yourselves!\" NL Vents pop out from the walls, billowing smoke into the room. You hear the creak of walls turning and moving, but with all the smoke in the way, you can't tell what's happening. NL \"Good luck reaching the end! Oh, and watch out for all the #rexploding Voltorbs!\" NL There were, in fact, ~many~ #rexploding Voltorbs. By the time you got past all the invisible barriers, collapsing walls, and slanting rooms, you felt like you had lost several years off your life. NL Your #yPokemon seemed inclined to agree.",
      "Your gut told you that perhaps this \"obstacle course\" would prove far more harrowing than you might suspect. NL As the man laughs at your retreating back, you think that perhaps your gut had been right after all."
    ],
    "OPTIONS": [
      "[Challenge the course] ",
      "[Discretion is the better part of valor] ",
      "Lose ",
      " Max HP.",
      "Obtain ",
      ".",
      "Remove a card from your deck.",
      "[Leave]"
    ]
  },
  "${ModID}:BerryBush": {
    "NAME": "Berry Bush",
    "DESCRIPTIONS": [
      "In the #gforest, you spot several plump #gberries growing on a nearby bush. Their delicious scent draws you closer, and you can't help but feel suddenly famished. NL Some cries draw your attention, and you turn to see that your #yPokemon also seem quite interested in the prize in front of you.",
      "Your hunger would not be denied. Chomping down into the #yberries, you fill your stomach with their #ydelicious interior amidst cries of disappointment from your companions. NL Feeling mildly #pguilty over the situation, you resolve to do something nice for your #yPokemon later down the line.",
      "Your #yPokemon cry out in joy as you share the #yberries with them. Watching them chow down, you manage to just barely suppress the pangs of hunger in your not-yet-satisfied stomach. NL This was a necessary #rsacrifice. After all, you wouldn't survive without their help."
    ],
    "OPTIONS": [
      "[Eat the berries yourself] ",
      "[Share the berries] ",
      "Heal ",
      " HP.",
      "All your Pokemon restore ",
      " Stamina.",
      "[Leave]"
    ]
  },
  "${ModID}:SaffronGym": {
    "NAME": "Saffron Gym",
    "DESCRIPTIONS": [
      "Up ahead, you hear a loud commotion. NL \"Sabrina! Today is the day that the Fighting Dojo is victorious and we become the official 6th Gym of Kanto!\" NL Across from the #yboisterous young man, a long-haired woman sighed. \"That's what you said the last dozen times you challenged me. What makes you think this time will be any different?\" NL \"I've put far more effort into training! This time, it will be my victory!\" NL The nearby crowd murmured, gauging the challenger's chances. Perhaps you could take the opportunity to #yobserve the upcoming battle and learn some new #ytricks yourself.",
      "Sabrina's fighting style is smooth and efficient. Her #yPokemon weaved one attack directly into another, carefully dancing from side to side and always maintaining its distance from the opponent's bulky Fighting-type #yPokemon. NL There is no wasted energy whatsoever. All that saved energy is #ytransformed directly into #rbrutal attacks against the opponent. NL Soon enough, the challenger's #yPokemon falls amidst cheers from the crowd. NL You have learned much from this encounter.",
      "The challenger's fighting style is simple, predictable, and repetitive. But there was a certain elegance to it all the same, a type of grace that could only be achieved from practicing the same strike over and over again for thousands of repetitions. Alas, the most #yperfect strike would still mean little if it could never connect with the opponent. NL Soon enough, the challenger's #yPokemon falls amidst cheers from the crowd. NL You have learned much from this encounter."
    ],
    "OPTIONS": [
      "[Observe Sabrina and her Pokemon] ",
      "[Observe the challenger and his Pokemon] ",
      "Transform a card.",
      "Duplicate a card.",
      "[Leave]"
    ]
  },
  "${ModID}:MagikarpSalesman": {
    "NAME": "Magikarp Salesman",
    "DESCRIPTIONS": [
      "\"Hey! You there!\" NL You turn to see an old man waving at you, some kind of fish #yPokemon in his arms. NL \"You're a #yPokemon #yTrainer, right? Well, have I got a deal for you! This here is #yMagikarp, one of the #yPokemon with the @highest@ potential in the world! And I'd be willing to part with it for a mere pittance - I'm sure a trainer like you would be more than enough to bring out its #ystrength!\" NL You stare at the fish, and the fish stares back with its dull, fish eyes. NL You can't help but feel you're being #pscammed.",
      "\"Many thanks for your patronage, friend!\" NL The salesman saunters away, whistling a #yjaunty tune. You heft your new fish friend in your arms, staring at it. NL It stares back with its #pdead fish gaze. NL Suddenly, it flops out of your arms, flailing around on the ground helplessly. NL You sigh. Hopefully, it would come in handy at some point.",
      "Quick as lightning, you whip your fist around and knock the salesman out cold. The fish flops to the ground, flailing around helplessly, but you ignore it in favor of rifling through the man's pockets, searching for anything of worth. NL After a minute of searching, you find some kind of #ytrinket. NL As you walk away, you can't help but feel a tinge of #pshame at your actions.",
      "You don't want to have anything to do with this salesman."
    ],
    "OPTIONS": [
      "[Accept the deal anyway] ",
      "[Rob the salesman] ",
      "Lose ",
      " Gold.",
      "Obtain ",
      ".",
      "Obtain a Relic.",
      "Become Cursed - ",
      "[Locked] Requires: Gold",
      "[Leave]"
    ]
  },
  "${ModID}:TradeOffer": {
    "NAME": "Trade Offer",
    "DESCRIPTIONS": [
      "As you're trekking along one of the many routes that make up this region, you hear a voice call out behind you. Turning, you see a young boy with a few #yPokemon besides him. NL He eyes you and your #yPokemon before giving an #yapproving nod. \"Your #yPokemon look pretty strong. How would you like to trade for one of mine?\" NL You look over his #yPokemon in turn, concluding that they too look fairly diverse and #ypowerful. Perhaps it wouldn't be a bad idea to take the offer.",
      "The two of you exchange #yPokeballs, concluding the trade. NL The boy nods in satisfaction. \"This was a worthwhile endeavor. Perhaps we'll again someday, stranger.\" NL The two of you part, heading your separate ways.",
      "\"Oh? That's shame. Very well then.\" The boy seems disappointed by your response. \"Perhaps if we ever meet again, you'll have changed your mind.\" NL The two of you part, heading your separate ways."
    ],
    "OPTIONS": [
      "[Trade] ",
      "[Decline] ",
      "Lose ",
      ".",
      "Obtain ",
      "[Leave]"
    ]
  },
  "${ModID}:MewsGame": {
    "NAME": "Mew's Game",
    "DESCRIPTIONS": [
      "As you're hiking through mountains, a small bipedal pink #yPokemon suddenly floats up next to you. NL \"Hey! Play with me!\" NL The words did not travel through the air, but instead transmitted themselves directly into your #ymind. NL \"If you win, I'll join you on your journey!\"",
      "\"Yay!\" The #yPokemon flips through the air in #gcelebration. As it completes several revolutions, a deck of cards suddenly manifests and began shuffling itself. NL \"Let's play Match Two! If you can match enough pairs, you win!\" NL The deck stops shuffling and spread itself out out before you. NL \"But be warned! These cards will have certain #yeffects when you match them, so choose carefully!\"",
      "The game is over and the result is your victory. The #yPokemon flips through the air, seemingly #gdelighted by this outcome. NL \"You won! That's great!\" NL It hovers closer to you, beaming. NL \"Let's have some fun adventures together, alright?\" NL You find this #yPokemon's enthusiasm to be rather over-the-top, but perhaps it wasn't such a bad thing.",
      "\"Aww, you ran out of attempts. Too bad!\" NL The #yPokemon twirls through the air, seemingly unbothered by this outcome. NL \"That's okay! Maybe next time.\" NL With a flicker of #ylight, it #pvanishes, disappearing just as suddenly as it had arrived.",
      "\"You don't want to play? That's too bad.\" NL The #yPokemon seems rather disappointed by your response. NL \"That's okay! Maybe next time.\" NL With a flicker of #ylight, it #pvanishes, disappearing just as suddenly as it had arrived."
    ],
    "OPTIONS": [
      "[Agree]",
      "[Decline]",
      "[Play]",
      "[Leave]",
      "Attempts Left: ",
      "Mew's Challenge: "
    ]
  },
  "${ModID}:VermilionGym": {
    "NAME": "Vermilion Gym",
    "DESCRIPTIONS": [
      "You poke your head into the gym, but it's oddly empty. Curious, you make your way to the backrooms, where you see many #yPokemon trapped in cages, seemingly distressed at their predicament. NL \"Do I smell a rat scurrying around?\" NL A gruff man in a military uniform turns the corner. You demand an explanation from him. \"These #pcowardly chumps? I @rescued@ them from their #psoft masters, that's what happened!\" He sneers. \"In time, they will make for a fine #rfighting #rforce under my tuition.\" NL He eyes you carefully. \"You seem like a strong one. Tell you what, don't say a word to anyone of what's happening here, and I'll give you a run through my #yspecial #ytraining #ycourse, free of charge!\"",
      "You take his #yoffer. The training is grueling, difficult, and #rhellish. But it did make you #ystronger, just as the man had advertised. NL As you leave, you spare one final glance for the kidnapped #yPokemon with a tinge of #pregret in your heart.",
      "\"Spurning my generous offer? You won't get away with this!\" NL The man surges forward, several ball-like #yPokemon following in his wake. You . . .",
      "You throw a potion in his face. The man cries out in agony as he writhes on the ground. His #yPokemon pause next to him, and you take the opportunity to sprint out of the gym and to the nearest authorities.",
      "You command your #yPokemon to make a distraction. One furious exchange of moves later, one of the ball-like #yPokemon flashes, then suddenly explodes with a tremendous @BOOM@ and covering the entire room in smoke. You take the opportunity to sprint out of the gym and to the nearest authorities.",
      "You decide to make a distraction yourself. Rushing toward one of the ball-like #yPokemon, you grab it and throw it directly at your opponent. NL @BOOM!@ The resulting explosion knocks you both away from each other. Groggily, you get up and take the opportunity to sprint out of the gym and to the nearest authorities.",
      " NL Soon afterward, the man is detained, and an officer approaches you. \"Thank you for your assistance. A lot of the townspeople were worried about their missing #yPokemon.\" She rifles in her pocket and gives you a #ybadge. \"Here, take this. The former Gym leader certainly doesn't deserve to be handing these out anymore, and I think you've more than earned it.\" NL You accept the badge, its weight in your pocket a reminder of the #ggood #gdeed you've done today."
    ],
    "OPTIONS": [
      "[Agree to keep silent] ",
      "[Run away and report him] ",
      "Upgrade ",
      " random cards.",
      "Become Cursed - ",
      ".",
      "Obtain a special Relic.",
      "Make a distraction.",
      "[Leave]",
      "[Throw a potion to distract him] ",
      "Lose ",
      "[Have a Pokemon distract him] ",
      "Choose a non-Starter Pokemon to lose ",
      " Stamina.",
      "[Distract him yourself] ",
      " HP.",
      "[Locked] Requires: Potion",
      "[Locked] Requires: non-Starter Pokemon with enough Stamina"
    ]
  },
  "${ModID}:TeamRocket": {
    "NAME": "Team Rocket",
    "DESCRIPTIONS": [
      "\"Prepare for trouble!\" NL \"And make it double!\" NL Those words are the only warning you receive before a net flies in out of nowhere and #rsnatches one of your #yPokemon. A man and woman jump into the scene, striking dramatic poses. NL \"We'll be taking that with us!\" NL \"And if you know what's good for you, you'll run before we take anything else from you!\"",
      "You send the goons and their #yPokemon flying away. In the distance, you vaguely hear them yelling something about \"blasting off again\", but you soon put that out of your mind. NL You pick up a #ytrinket and some #ymoney they dropped and continue on your way.",
      "Although it leaves you with a tinge of #pregret, you abandon your #yPokemon to the duo's clutches. NL Sometimes, sacrifices had to be made for the greater good."
    ],
    "OPTIONS": [
      "[Rescue your Pokemon] ",
      "[Run away] ",
      "Fight.",
      "Obtain a Relic.",
      "Lose ",
      ".",
      "[Leave]"
    ]
  }
}