{
  "${ModID}:ProfessorOptions": {
    "NAME": "",
    "DESCRIPTIONS": [
    ],
    "OPTIONS": [
      "[Continue] ",
      "Receive Pokeballs.",
      "Choose a Starter Pokemon.",
      "[Leave]",
      "[Receive supplies] ",
      "Gain ",
      " Max HP.",
      "[Receive stipend] ",
      "Gain ",
      " Gold."
    ]
  },
  "${ModID}:ProfessorOak": {
    "NAME": "Professor Oak",
    "DESCRIPTIONS": [
      "Oh, a new trainer about to start their journey?",
      "You may be starting later than others, but better late than never! Here's some Pokeballs to get you started.",
      "Now choose a companion to begin your journey with.",
      "I hope you make many fond memories together.",
      "Oh, it's you! You've been making a name for yourself out there.",
      "Let's see . . . you've caught #b",
      " Pokemon. ",
      "That's amazing!",
      "You're doing good work.",
      "I hope you'll put in a little more effort.",
      "I have some extra Pokeballs lying around - take them.",
      "Would you like some supplies or a stipend?"
    ],
    "OPTIONS": [
    ]
  },
  "${ModID}:ProfessorElm": {
    "NAME": "Professor Elm",
    "DESCRIPTIONS": [
      ". . . A visitor? Sorry, I was distracted.",
      "You want . . . Pokeballs, right? I'm sure I have some left . . .",
      "You should take one of these #gevolved starters with you . . . it'll be safer.",
      "Now . . . what was I doing again?",
      "You . . . I think I heard Oak mention you before . . .",
      "Let's see . . . you've caught #b",
      " Pokemon. ",
      "That's pretty good . . .",
      "Seems average . . .",
      "Maybe you should throw more Pokeballs . . .",
      "Anyway . . . you can have some of these Pokeballs lying around . . .",
      "There's also some extra supplies . . . unless you'd like some money instead?"
    ],
    "OPTIONS": [
    ]
  },
  "${ModID}:ProfessorBirch": {
    "NAME": "Professor Birch",
    "DESCRIPTIONS": [
      "Oh, a new arrival?",
      "Here, let me scrounge up some Pokeballs for you.",
      "It's gotten more dangerous lately; I'd feel better if you took one of these #gevolved starters with you.",
      "Good luck out there.",
      "Oh, it's you! I've heard about you from my colleagues.",
      "Let's see . . . you've caught #b",
      " Pokemon. ",
      "That's impressive!",
      "You're making decent progress.",
      "That's a little on the low end.",
      "In any case, here are some spare Pokeballs for you.",
      "I also have some extra supplies. Unless you'd like a stipend instead?"
    ],
    "OPTIONS": [
    ]
  },
  "${ModID}:CeladonGym": {
    "NAME": "Celadon Gym",
    "DESCRIPTIONS": [
      "As you're walking through a #yrainbow-colored city, you suddenly hear the panicked cries of nearby people. NL \"Someone help! The gym is on #rfire!\" NL You find the building in question, and it is indeed very much on #rfire. You see that some #yPokemon are trapped inside - perhaps you could help? On the other hand, the #pcrisis has left the nearby storerooms unattended, and you ARE feeling awfully hungry . . .",
      "You let your conscience guide your actions, and with a heroic leap, you dive into the flames and come out with a few #rburns and a #rsinged #yPokemon in your arms. NL \"Gloom! You're safe!\" NL A woman in a kimono rushes up to you, and the #yPokemon in your arms jumps into hers. NL \"Thank you so much for saving Gloom. Here, take this #yRainbow #yBadge as thanks for your bravery.\" NL You slip the badge into your pocket and carry onward with your head held high.",
      "Inside the storeroom, you find a variety of delectable fruits. Although you feel slightly guilty over your actions, your survival was a far higher priority than keeping a clean conscience."
    ],
    "OPTIONS": [
      "[Rescue Pokemon] ",
      "[Steal some fruit] ",
      "Lose ",
      " HP.",
      "Obtain a Special Relic.",
      "Gain ",
      " Max HP.",
      "[Leave]"
    ]
  },
  "${ModID}:PokemonCenter": {
    "NAME": "Pokemon Center",
    "DESCRIPTIONS": [
      "You find yourself inside a large, crowded building with people constantly going in and out. A large welcome poster on the nearby wall indicates that this place is known as a \"Pokemon Center\" where your companions can have their strength #grestored. NL \"Excuse me, everyone!\" A nearby figure in a nurse's uniform called out. \"We're running a bit low on supplies. If anyone has any extras, we'd be happy to buy them off you!\" NL Although, a little extra #ycurrency in your pocket certainly wouldn't hurt either.",
      "You hand over one of your spare potions, and the nurse hands you some currency with a #ysmile on her face. NL \"Thank you very much! I'm sure someone will appreciate this very soon.\" NL You hope that you don't end up missing that potion very soon.",
      "You hand over your Pokeballs to one of the nurses at a counter, and you settle in for a long wait. NL After what feels like an eternity, your team is returned to you, and you continue on your #yjourney."
    ],
    "OPTIONS": [
      "[Sell excess supplies] ",
      "[Heal your Pokemon] ",
      "Lose ",
      ".",
      "Gain ",
      " Gold.",
      "Fully restore the Stamina of all your Pokemon.",
      "[Leave]",
      "[Locked] Requires: Potion"
    ]
  },
  "${ModID}:FuchsiaGym": {
    "NAME": "Fuchsia Gym",
    "DESCRIPTIONS": [
      "The mansion in front of you looks plain, unassuming - a casual eye would easily gloss over the building entirely. As you enter, a man wound as tight as a coil, like a #pserpent about to strike, greets you. NL \"A new challenger! You have a #rwarrior's look about you, unlike those other fresh-faced trainers.\" He grins at you. \"What say you to challenging my gym's #yobstacle #ycourse? I guarantee that both you and your #yPokemon will come out stronger on the other side!\" NL The man looks sincere, but you can't help but cast a #pdubious look around the room, wondering what exactly would be in store for you.",
      "\"A fine choice!\" The man declares. \"Now, brace yourselves!\" NL Vents pop out from the walls, billowing smoke into the room. You hear the creak of walls turning and moving, but with all the smoke in the way, you can't tell what's happening. NL \"Good luck reaching the end! Oh, and watch out for all the #rexploding Voltorbs!\" NL There were, in fact, ~many~ #rexploding Voltorbs. By the time you got past all the invisible barriers, collapsing walls, and slanting rooms, you felt like you had lost several years off your life. NL Your #yPokemon seemed inclined to agree.",
      "Your gut told you that perhaps this \"obstacle course\" would prove far more harrowing than you might suspect. NL As the man laughs at your retreating back, you think that perhaps your gut had been right after all."
    ],
    "OPTIONS": [
      "[Challenge the course] ",
      "[Discretion is the better part of valor] ",
      "Lose ",
      " Max HP.",
      "Obtain ",
      ".",
      "Remove a card from your deck.",
      "[Leave]"
    ]
  },
  "${ModID}:BerryBush": {
    "NAME": "Berry Bush",
    "DESCRIPTIONS": [
      "In the #gforest, you spot several plump #gberries growing on a nearby bush. Their delicious scent draws you closer, and you can't help but feel suddenly famished. NL Some cries draw your attention, and you turn to see that your #yPokemon also seem quite interested in the prize in front of you.",
      "Your hunger would not be denied. Chomping down into the #yberries, you fill your stomach with their #ydelicious interior amidst cries of disappointment from your companions. NL Feeling mildly #pguilty over the situation, you resolve to do something nice for your #yPokemon later down the line.",
      "Your #yPokemon cry out in joy as you share the #yberries with them. Watching them chow down, you manage to just barely suppress the pangs of hunger in your not-yet-satisfied stomach. NL This was a necessary #rsacrifice. After all, you wouldn't survive without their help."
    ],
    "OPTIONS": [
      "[Eat the berries yourself] ",
      "[Share the berries] ",
      "Heal ",
      " HP.",
      "All your Pokemon restore ",
      " Stamina.",
      "[Leave]"
    ]
  },
  "${ModID}:SaffronGym": {
    "NAME": "Saffron Gym",
    "DESCRIPTIONS": [
      "Up ahead, you hear a loud commotion. NL \"Sabrina! Today is the day that the Fighting Dojo is victorious and we become the official 6th Gym of Kanto!\" NL Across from the #yboisterous young man, a long-haired woman sighed. \"That's what you said the last dozen times you challenged me. What makes you think this time will be any different?\" NL \"I've put far more effort into training! This time, it will be my victory!\" NL The nearby crowd murmured, gauging the challenger's chances. Perhaps you could take the opportunity to #yobserve the upcoming battle and learn some new #ytricks yourself.",
      "Sabrina's fighting style is smooth and efficient. Her #yPokemon weaved one attack directly into another, carefully dancing from side to side and always maintaining its distance from the opponent's bulky Fighting-type #yPokemon. NL There is no wasted energy whatsoever. All that saved energy is #ytransformed directly into #rbrutal attacks against the opponent. NL Soon enough, the challenger's #yPokemon falls amidst cheers from the crowd. NL You have learned much from this encounter.",
      "The challenger's fighting style is simple, predictable, and repetitive. But there was a certain elegance to it all the same, a type of grace that could only be achieved from practicing the same strike over and over again for thousands of repetitions. Alas, the most #yperfect strike would still mean little if it could never connect with the opponent. NL Soon enough, the challenger's #yPokemon falls amidst cheers from the crowd. NL You have learned much from this encounter."
    ],
    "OPTIONS": [
      "[Observe Sabrina and her Pokemon] ",
      "[Observe the challenger and his Pokemon] ",
      "Transform a card.",
      "Duplicate a card.",
      "[Leave]"
    ]
  },
  "${ModID}:MagikarpSalesman": {
    "NAME": "Magikarp Salesman",
    "DESCRIPTIONS": [
      "\"Hey! You there!\" NL You turn to see an old man waving at you, some kind of fish #yPokemon in his arms. NL \"You're a #yPokemon #yTrainer, right? Well, have I got a deal for you! This here is #yMagikarp, one of the #yPokemon with the @highest@ potential in the world! And I'd be willing to part with it for a mere pittance - I'm sure a trainer like you would be more than enough to bring out its #ystrength!\" NL You stare at the fish, and the fish stares back with its dull, fish eyes. NL You can't help but feel you're being #pscammed.",
      "\"Many thanks for your patronage, friend!\" NL The salesman saunters away, whistling a #yjaunty tune. You heft your new fish friend in your arms, staring at it. NL It stares back with its #pdead fish gaze. NL Suddenly, it flops out of your arms, flailing around on the ground helplessly. NL You sigh. Hopefully, it would come in handy at some point.",
      "Quick as lightning, you whip your fist around and knock the salesman out cold. The fish flops to the ground, flailing around helplessly, but you ignore it in favor of rifling through the man's pockets, searching for anything of worth. NL After a minute of searching, you find some kind of #ytrinket. NL As you walk away, you can't help but feel a tinge of #pshame at your actions.",
      "You don't want to have anything to do with this salesman."
    ],
    "OPTIONS": [
      "[Accept the deal anyway] ",
      "[Rob the salesman] ",
      "Lose ",
      " Gold.",
      "Obtain ",
      ".",
      "Obtain a Relic.",
      "Become Cursed - ",
      "[Locked] Requires: Gold",
      "[Leave]"
    ]
  },
  "${ModID}:TradeOffer": {
    "NAME": "Trade Offer",
    "DESCRIPTIONS": [
      "As you're trekking along one of the many routes that make up this region, you hear a voice call out behind you. Turning, you see a young boy with a few #yPokemon besides him. NL He eyes you and your #yPokemon before giving an #yapproving nod. \"Your #yPokemon look pretty strong. How would you like to trade for one of mine?\" NL You look over his #yPokemon in turn, concluding that they too look fairly diverse and #ypowerful. Perhaps it wouldn't be a bad idea to take the offer.",
      "The two of you exchange #yPokeballs, concluding the trade. NL The boy nods in satisfaction. \"This was a worthwhile endeavor. Perhaps we'll again someday, stranger.\" NL The two of you part, heading your separate ways.",
      "\"Oh? That's shame. Very well then.\" The boy seems disappointed by your response. \"Perhaps if we ever meet again, you'll have changed your mind.\" NL The two of you part, heading your separate ways."
    ],
    "OPTIONS": [
      "[Trade] ",
      "[Decline] ",
      "Lose ",
      ".",
      "Obtain ",
      "[Leave]"
    ]
  },
  "${ModID}:MewsGame": {
    "NAME": "Mew's Game",
    "DESCRIPTIONS": [
      "As you're hiking through mountains, a small bipedal pink #yPokemon suddenly floats up next to you. NL \"Hey! Play with me!\" NL The words did not travel through the air, but instead transmitted themselves directly into your #ymind. NL \"If you win, I'll join you on your journey!\"",
      "\"Yay!\" The #yPokemon flips through the air in #gcelebration. As it completes several revolutions, a deck of cards suddenly manifests and began shuffling itself. NL \"Let's play Match Two! If you can match enough pairs, you win!\" NL The deck stops shuffling and spread itself out out before you. NL \"But be warned! These cards will have certain #yeffects when you match them, so choose carefully!\"",
      "The game is over and the result is your victory. The #yPokemon flips through the air, seemingly #gdelighted by this outcome. NL \"You won! That's great!\" NL It hovers closer to you, beaming. NL \"Let's have some fun adventures together, alright?\" NL You find this #yPokemon's enthusiasm to be rather over-the-top, but perhaps it wasn't such a bad thing.",
      "\"Aww, you ran out of attempts. Too bad!\" NL The #yPokemon twirls through the air, seemingly unbothered by this outcome. NL \"That's okay! Maybe next time.\" NL With a flicker of #ylight, it #pvanishes, disappearing just as suddenly as it had arrived.",
      "\"You don't want to play? That's too bad.\" NL The #yPokemon seems rather disappointed by your response. NL \"That's okay! Maybe next time.\" NL With a flicker of #ylight, it #pvanishes, disappearing just as suddenly as it had arrived."
    ],
    "OPTIONS": [
      "[Agree]",
      "[Decline]",
      "[Play]",
      "[Leave]",
      "Attempts Left: ",
      "Mew's Challenge: "
    ]
  },
  "${ModID}:VermilionGym": {
    "NAME": "Vermilion Gym",
    "DESCRIPTIONS": [
      "You poke your head into the gym, but it's oddly empty. Curious, you make your way to the backrooms, where you see many #yPokemon trapped in cages, seemingly distressed at their predicament. NL \"Do I smell a rat scurrying around?\" NL A gruff man in a military uniform turns the corner. You demand an explanation from him. \"These #pcowardly chumps? I @rescued@ them from their #psoft masters, that's what happened!\" He sneers. \"In time, they will make for a fine #rfighting #rforce under my tuition.\" NL He eyes you carefully. \"You seem like a strong one. Tell you what, don't say a word to anyone of what's happening here, and I'll give you a run through my #yspecial #ytraining #ycourse, free of charge!\"",
      "You take his #yoffer. The training is grueling, difficult, and #rhellish. But it did make you #ystronger, just as the man had advertised. NL As you leave, you spare one final glance for the kidnapped #yPokemon with a tinge of #pregret in your heart.",
      "\"Spurning my generous offer? You won't get away with this!\" NL The man surges forward, several ball-like #yPokemon following in his wake. You . . .",
      "You throw a potion in his face. The man cries out in agony as he writhes on the ground. His #yPokemon pause next to him, and you take the opportunity to sprint out of the gym and to the nearest authorities.",
      "You command your #yPokemon to make a distraction. One furious exchange of moves later, one of the ball-like #yPokemon flashes, then suddenly explodes with a tremendous @BOOM@ and covering the entire room in smoke. You take the opportunity to sprint out of the gym and to the nearest authorities.",
      "You decide to make a distraction yourself. Rushing toward one of the ball-like #yPokemon, you grab it and throw it directly at your opponent. NL @BOOM!@ The resulting explosion knocks you both away from each other. Groggily, you get up and take the opportunity to sprint out of the gym and to the nearest authorities.",
      " NL Soon afterward, the man is detained, and an officer approaches you. \"Thank you for your assistance. A lot of the townspeople were worried about their missing #yPokemon.\" She rifles in her pocket and gives you a #ybadge. \"Here, take this. The former Gym leader certainly doesn't deserve to be handing these out anymore, and I think you've more than earned it.\" NL You accept the badge, its weight in your pocket a reminder of the #ggood #gdeed you've done today."
    ],
    "OPTIONS": [
      "[Agree to keep silent] ",
      "[Run away and report him] ",
      "Upgrade ",
      " random cards.",
      "Become Cursed - ",
      ".",
      "Obtain a special Relic.",
      "Make a distraction.",
      "[Leave]",
      "[Throw a potion to distract him] ",
      "Lose ",
      "[Have a Pokemon distract him] ",
      "Choose a non-Starter Pokemon to lose ",
      " Stamina.",
      "[Distract him yourself] ",
      " HP.",
      "[Locked] Requires: Potion",
      "[Locked] Requires: non-Starter Pokemon with enough Stamina"
    ]
  },
  "${ModID}:TeamRocket": {
    "NAME": "Team Rocket",
    "DESCRIPTIONS": [
      "\"Prepare for trouble!\" NL \"And make it double!\" NL Those words are the only warning you receive before a net flies in out of nowhere and #rsnatches one of your #yPokemon. A man and woman jump into the scene, striking dramatic poses. NL \"We'll be taking that with us!\" NL \"And if you know what's good for you, you'll run before we take anything else from you!\"",
      "You send the goons and their #yPokemon flying away. In the distance, you vaguely hear them yelling something about \"blasting off again\", but you soon put that out of your mind. NL You pick up a #ytrinket and some #ymoney they dropped and continue on your way.",
      "Although it leaves you with a tinge of #pregret, you abandon your #yPokemon to the duo's clutches. NL Sometimes, sacrifices had to be made for the greater good."
    ],
    "OPTIONS": [
      "[Rescue your Pokemon] ",
      "[Run away] ",
      "Fight.",
      "Obtain a Relic.",
      "Lose ",
      ".",
      "[Leave]"
    ]
  },
  "${ModID}:CinnabarGym": {
    "NAME": "Cinnabar Gym",
    "DESCRIPTIONS": [
      "In the gym's secret #ylaboratory, you find an old, dusty videotape. After fiddling with the nearby #yelectronics, you manage to get the tape to play on a nearby TV. NL \"The project . . . it is almost complete.\" A haggard-looking old man appears on the grainy screen. His brows are creased with stress. \"But the closer I am to completion, the further I want to step away from it all. Is finishing my research truly the right thing to do?\" NL The screen flickers, distorting. When it snaps back, you see - ",
      "\"No . . . there is no glory to be had in completing a weapon of destruction. Not for the likes of #rTeam #rRocket.\" NL The man musters a faint #ysmile. \"I hope Misty, Brock, and Erika will #gforgive me. What a foolish Gym Leader I've been.\" NL The screens cuts out. You felt inspired by the researcher's display of courage. NL You wonder where he is now.",
      "\"It's too late to stop. The project will be finished whether I am here or not.\" NL The man smiles #psorrowfully. \"I can only hope that I will be able to mitigate the damage caused by the greatest #yPokemon of all . . . #pMewtwo.\" NL The screens cuts out. You wonder what happened to that man, in the end."
    ],
    "OPTIONS": [
      "[The man defecting] ",
      "[The man continuing] ",
      "Lose ",
      ".",
      "Obtain ",
      "Upgrade a card.",
      "[Leave]"
    ]
  },
  "${ModID}:Yellow": {
    "NAME": "Memorial to Yellow",
    "DESCRIPTIONS": [
      "In the middle of the clearing, you spot a stone statue of a long-haired trainer with several #yPokemon statues surrounding them. Despite only being an imitation frozen in time, you can sense the #yfiery determination hidden within the figure's #yblazing eyes. You wonder what great deed this figure accomplished, to have a statue of themselves placed here. NL Looking around, you notice several #yPokemon gathering in the clearing, seemingly drawn towards the statue and its stony companions. Perhaps you could coax one of them to join you on your journey?",
      "With a few #ynudges and #ysoft words, you are able to get one of the nearby #yPokemon to follow you. As you exit the clearing, you glance back, wondering if someday you would do something #ygrand enough to have a statue of your own somewhere.",
      "You decide that you don't need any more #ycompanions on your journey."
    ],
    "OPTIONS": [
      "[Befriend] ",
      "Obtain ",
      ".",
      "[Leave]"
    ]
  },
  "${ModID}:PokemonTrainerSchool": {
    "NAME": "Pokemon Trainers' School",
    "DESCRIPTIONS": [
      "A nearby poster catches your attention - it states that a #yrenowned school was holding an event and inviting all to attend. Curious, you decide to check it out. NL Inside the school, you find yourself being quickly greeted by a teacher. \"Hello! Are you here to attend the lessons or to have a mock battle?\" NL You realize that you forgot to check what the #yevent was actually about as you @scramble@ for an answer.",
      "You answer that you wish to attend a lesson. The teacher leads you to a classroom filled with people of all ages. Inside, a woman with brown hair is explaining something called the \"type chart\". NL \"So just remember that #yRock beats #yFire, and that #yGround also beats #yFire, but not in quite the same way #yRock does - \" NL You feel that you have learned . . . #ysomething, from the lesson. Probably.",
      "You answer that you wish to participate in a mock battle. The teacher leads you to a battle ground filled with people of all ages and their #yPokemon. Soon, you get partnered with someone and the two of you begin battling. After some back and forth, your #yPokemon emerges victorious. NL \"Congratulations on winning!\" The teacher hands you a small claw. \"Here, take this as a prize.\" NL You accept the claw. It makes you feel strangely lighter."
    ],
    "OPTIONS": [
      "[Attend lesson] ",
      "[Mock battle] ",
      "Choose 1 of ",
      " cards to add to your deck.",
      "A non-Starter Pokemon loses ",
      " Stamina.",
      "Obtain a special Relic.",
      "[Leave]",
      "[Locked] Requires: non-Starter Pokemon with enough Stamina",
      "Choose a card to add to your deck.",
      "Choose a Pokemon to lose Stamina."
    ]
  },
  "${ModID}:WishUponAStar": {
    "NAME": "Wish Upon a Star",
    "DESCRIPTIONS": [
      "You see a #yshining #ycomet fall down from the sky, landing nearby. As you approach its landing spot, you catch sight of a small, white #yPokemon floating in the air. It glances around then floats up towards you, tilting its head inquisitively. It seems quite interested in the #yfood in your bag. NL \"Jirachi, the #yWish #yPokemon. Reputed to have the power to grant wishes.\" Your Pokedex piped up with that helpful information. Seeing the empty wish tags on its body, you wonder . . .",
      "You consider your wish carefully . . .",
      "You make a wish. The wish tag #ylights up, strange letters inscribing themselves onto it. The #ylight grows stronger and stronger, before finally expanding outwards in a wave that enveloped you - NL You blink. You could tell that your wish had been #ygranted. But at what #rcost . . . ?",
      "You open your bag, offering up the food inside. #yJirachi happily munches down, floating upward with a contented look. You can feel your stomach #pgrowl at the sight of giving away food, but you manage to perservere. NL After finishing its meal, #yJirachi floats itself down to your shoulder, giving you an encouraging look. Looks like you had a new #gcompanion for the road ahead."
    ],
    "OPTIONS": [
      "[Make a wish] ",
      "[Offer it food] ",
      "Obtain a Wish.",
      "Bear the consequences.",
      "Lose ",
      " Max HP.",
      "Obtain ",
      ".",
      "[Leave]",
      "[Wish for Power] ",
      "[Wish for Wealth] ",
      "[Wish for Knowledge] "
    ]
  },
  "${ModID}:BumpInTheRoad": {
    "NAME": "Bump in the Road",
    "DESCRIPTIONS": [
      "As you're walking along a narrow path, you suddenly #rbump into something and stumble backwards. You frown, blinking, as you stare at the #phazy distortion in front of you. Was something . . . there? How irritating.",
      "With a forceful swing, you send the invisible presence @flying@ into the distance - at least, you #ythink you sent them flying. It was hard to tell, what with them being invisible and all. NL At the very least, the path was unblocked now.",
      "Taking some food out of your bag, you toss it off into the distance. You some sense motion as the invisible presence moves off to the side, following the trail of food. NL Although it was #punfortunate to lose some #ysupplies, at least the path was unblocked now.",
      "Alas, getting around an invisible bump in the road was beyond your capabilities, so you'll just have to take the long way around."
    ],
    "OPTIONS": [
      "[Knock it aside forcefully] ",
      "[Lure it away skillfully] ",
      "[Take the long way around] ",
      "Lose ",
      ".",
      "Upgrade a card.",
      "Remove a card.",
      "[Leave]"
    ]
  },
  "${ModID}:FeatherCarnival": {
    "NAME": "Feather Carnival",
    "DESCRIPTIONS": [
      "You find yourself in the midst of a #yfair, laughter and chirping filling the air as dozens of Flying-type #yPokemon fill the #bskies overhead. NL A nearby vendor beckons to you. \"Ho there, stranger! Wanna give my game a try? First attempt's free!\" NL You eye the vendor's stall, seeing that it was some kind of #yshooting game. Perhaps it wouldn't hurt to give it a try.",
      "You pick up the plastic gun, eyeing the targets at the far end. With careful precision, you #rnail the plastic cups with pinpoint shots. NL \"Woah, looks like we got a real sharpshooter over here!\" the vendor exclaimed. NL You nod in satisfaction. You feel that this game has #yimproved your skills."
    ],
    "OPTIONS": [
      "[Play once] ",
      "[Play a few times] ",
      "[Play multiple times] ",
      "Upgrade a random card.",
      "Lose ",
      " Gold.",
      "Upgrade ",
      " random cards.",
      "[Locked] Requires: Gold",
      "[Leave]"
    ]
  },
  "${ModID}:LavaridgeGym": {
    "NAME": "Lavaridge Gym",
    "DESCRIPTIONS": [
      "As you walk by a wide, rectangular building, you notice a #rred-haired woman filling in numerous holes dotted all around the building. NL \"Hey! Wanna help me out here? The last challenger decided to be a #pnuisance and tear up the ground with excessive use of Dig!\" NL You pause, considering the woman's request. You didn't know what you would #ggain from helping her, but perhaps not every choice needed to have an obvious gain involved.",
      "You tell the woman that you would help her. NL \"Great! Grab a shovel and start shoveling.\" NL After a couple hours of #pback-breaking work under the #rsweltering sun, the two of you finally finish filling in every last hole. The woman smiles, patting you on the back as she hands you a water bottle. \"Thanks for the help! You can keep the shovel - looks like you got pretty good at swinging it around!\" NL You stare at the shovel in your hands - it looked to be of #yhigh #yquality. Maybe you could dig up something useful with it later. NL As you leave, you notice that you feel a bit #rclumsy from exhaustion.",
      "You tell the woman that unfortunately, you didn't have time to help her. NL The woman shrugged. \"Ah, well, it was worth a shot.\" NL You continue on your way, paying her no further mind.",
      "As you walk by a wide, rectangular building, you notice a #rred-haired woman filling in numerous holes dotted all around the building. NL \"Hey! Wanna help me out here? The last challenger decided to be a #pnuisance and tear up the ground with excessive use of Dig!\" The woman paused, scrutinizing you. \"You even have your own shovel already, don't you? Come on, I'll make it worth your while!\" NL You stop to consider the woman's request.",
      "You tell the woman that you would help her. NL \"Great! Get over here and start shoveling.\" NL After a couple hours of work, the two of you finally finish filling in every last hole. The woman smiles, patting you on the back as she hands you a water bottle. \"Thanks for the help! Here's a little #ytrinket as thanks.\" NL You take the offered #yrelic. Perhaps it would come in handy later."
    ],
    "OPTIONS": [
      "[Help] ",
      "[Decline] ",
      "Obtain a special Relic.",
      "Become Cursed - ",
      ".",
      "[Leave]",
      "Obtain a Relic."
    ]
  },
  "${ModID}:WeatherInstitute": {
    "NAME": "Weather Institute",
    "DESCRIPTIONS": [
      "As you pass by a strange-looking building with strangely-shaped devices mounted on its roof, you notice the shuffle of suspicious figures loitering around it. Curious, you sneak closer and hear the shouts and scuffle of an #raltercation inside. NL \"This is #bTeam #bAqua! Hand over all your data on weather and ancient #yPokemon, and no one gets hurt!\" NL Hearing the frightened mutters of the researchers inside, you consider your options.",
      "You wait patiently for the #pcriminals to let their guards down. Although you notice that the researchers are having an unpleasant time while you wait, you know better than to let your #yemotions cloud your judgment. NL You wait for the grunts to distract themselves with the research, then you @strike@ like a flash of #ylightning! NL The #pcriminals fall like dominoes, and the scientists offer you their thanks. You felt like you learned something from your patient #yambush.",
      "You rush in, unwilling to let the #pcriminals have their way for even a moment longer. The grunts and their #yPokemon batter you with their fists and spouts of water, but you endure and take them all down. NL The scientists are immensely grateful for your quick response and offer you an ancient #yrelic as thanks."
    ],
    "OPTIONS": [
      "[Wait for an opening] ",
      "[Rush in recklessly] ",
      "Give a card in your deck +",
      " Block and Retain.",
      "Lose ",
      " HP.",
      "Choose 1 of 3 Relics to obtain.",
      "[Leave]",
      "Obtain ",
      "."
    ]
  },
  "${ModID}:Mossdeep": {
    "NAME": "Mossdeep Space Center",
    "DESCRIPTIONS": [
      "The air is filled with the smell of ozone, gas, and . . . the sound of #rpanicked yelling. Stopping a nearby passerby, you ask them what's going on. NL \"Team Magma sent a letter saying they were gonna come steal our #yrocket fuel! We don't know what to do!\" NL The person resumes panicking. You wonder if there wasn't some sort of #yorganization they were supposed to contact at times like this.",
      "With all the #pcommotion going on, it was trivially easy to take some #yrocket fuel for yourself. As repayment, you decide to leave a tip for the #ypolice so that they could come and do their jobs.",
      "You find the person in charge and inform them that you were willing to help stand guard. The official thanks you for your help, and you find a nice spot to stand around until the #rattack. NL After several hours, #rTeam #rMagma finally showed up. Luckily, someone had the forethought to inform the police ahead of time, so driving the #pcriminals back wasn't particularly difficult. You felt like you had learned . . . something, from this #yincident."
    ],
    "OPTIONS": [
      "[Take some fuel] ",
      "[Offer to stand guard] ",
      "Give a card in your deck +",
      " damage and Ethereal.",
      "Lose ",
      " max HP.",
      "Obtain a Rare card.",
      "[Leave]"
    ]
  },
  "${ModID}:Altomare": {
    "NAME": "Altomare",
    "DESCRIPTIONS": [
      "\"Excuse me, would you be willing to be a model for my painting?\" NL You pause, startled by the young girl's sudden request. However, you detect only an earnest #ydesire in her eyes, so you decide to humor her. NL The girl smiled. \"Thank you. Please, have a seat right there.\" She returned to her canvas, ~sweeping~ across it with long, flowing strokes while you sat there by the riverbank, listening to the ebb and flow of the #bwaves. You decide that this wasn't such a bad way to spend an afternoon. NL \"I have a couple of shy #yfriends.\" The girl speaks up without looking away from her painting. \"I think it would be good for them to expand their horizons and travel the world. Would you like to meet them?\"",
      "You agree to meet them. The girl seems #ypleased as she packs up her canvas and tools. \"Follow me. My friends are waiting in a secret location.\" NL As you follow her to this secret location, you suddenly hear a loud commotion nearby. The girl's eyes widen in shock. \"Someone's after them! Quick, we need to help!\"",
      "You signed up for a meet-and-greet, not for an altercation with criminals! With a heavy heart, you convey your intentions to the girl. NL \"It's okay; I was asking too much of you.\" Her face stiffened as a loud crash rang out nearby. \"I need to go. I hope they're alright.\" NL The girl rushes off, and you watch her go. You hope things turn out #yfavorably for her and her friends.",
      "You fend off the criminal attackers and send them fleeing. The girl rushes towards her #yPokemon friends and hugs them tightly. \"Oh, thank goodness you're alright!\" NL The two #yPokemon chirp and nudge the girl #yaffectionately in response. She turns to face you with a smile. \"Well, after your brave display of #yheroism, I feel confident in trusting you with my friends' safety.\" She nods towards them. \"Who would you like to accompany you? I'm sure they'll be helpful on your journey!\"",
      "You make your selection. #yLatias hovers forward and gives you a soft #ysmile. You sense that she's eager to travel the world and see what it has to offer.",
      "You make your selection. #yLatios hovers forward and gives you a #yrespectful nod. You sense that he's eager to improve himself by experiencing what the world has to offer.",
      "You decline the offer. You didn't feel like staying in this city for much longer. NL \"Oh, that's too bad.\" The girl's brush stops. She picks up the #ypainting and shows it to you. \"Well? How is it?\" NL You have to admit that it was a pretty #yfaithful rendition of yourself. NL \"Here, you can keep it as thanks for indulging me.\" NL You accept the #ypainting, waved goodbye to the girl, and proceeded onward with your journey."
    ],
    "OPTIONS": [
      "[Agree to meet them] Encounter some trouble along the way.",
      "[Decline the offer] ",
      "Duplicate a card.",
      "[Run in and help] ",
      "Fight off the attackers.",
      "Save the girl's friends.",
      "Obtain ",
      ".",
      "[Leave]"
    ]
  },
  "${ModID}:Pokemart": {
    "NAME": "Poke Mart",
    "DESCRIPTIONS": [
      "You look around the store, seeing a wide variety of items on display. A banner pinned to the wall #yproudly proclaimed \"All your item needs fulfilled!\" - you suspect that with such a large stock, such a claim might not be an exaggeration after all. NL You pause between two aisles. One offered potions for sale. The other offered extra #yPokeballs. Which one should you buy with your limited #yfunds?",
      "Potions were always an #yinvaluable asset in battle. Even if people sometimes gave you strange looks for using them on yourself instead of on your #yPokemon.",
      "Extra #yPokeballs were always useful. The right #yPokemon could turn the tide of any battle around.",
      "You decide to save your #ymoney. Maybe there would be better things to buy later."
    ],
    "OPTIONS": [
      "[Potions] ",
      "[Pokeballs] ",
      "Lose ",
      " Gold.",
      "Obtain ",
      " Potions.",
      " Pokeballs.",
      "[Leave]"
    ]
  },
  "${ModID}:AncientRuins": {
    "NAME": "Ancient Ruins",
    "DESCRIPTIONS": [
      "As you delve into the depths of this ancient ruin, you feel your #ytreasure senses tingle. Sure enough, on the lowest level of this ruin, you spy a room full of @shiny@ #yjewels and ancient #yrelics! NL As your hand reaches out to claim your prize, a sudden premonition halts your hand. Was taking treasure from this ancient place truly a good idea? Surely these trinkets weren't #pcursed or anything, right?",
      "You give in to your desires, swiping the shiny #yjewel on the center pedestal as well as one of the nearby #yrelics. Alas, you couldn't carry all this loot out with you, but at least that meant there would be plenty of leftover treasure for the next dungeon delver that came along. NL As you head outside, you feel a much #rstronger premonition. Someone was . . . #pdispleased by your actions. NL Hopefully, you would never meet this someone.",
      "You withdraw your hand. Something told you that stealing long-forgotten #ytreasure might be a bad idea."
    ],
    "OPTIONS": [
      "[Take some treasure] ",
      "Obtain a Relic.",
      "The Act boss becomes enhanced.",
      "[Leave]"
    ]
  },
  "${ModID}:OlivineLighthouse": {
    "NAME": "Olivine Lighthouse",
    "DESCRIPTIONS": [
      "In front of you, a lighthouse shines faintly with a muted #ylight. You decide that the view from the top would greatly aid you in surveying the layout of the nearby land, so you proceed to climb the stairwell to the top. As you reach the beacon room, you find that a sickly-looking #yPokemon is the source of the #ylight you saw. NL \"If you wanted to challenge me, I'm afraid you'll have to wait.\" A woman sits next to the #yPokemon, tending to it. She looks at you, pausing. \"I see you have some #gmedicine with you. Would you mind trading for it?\"",
      "You hand over the medicine. In exchange, the woman hands you a #yPokeball. NL \"Thank you for that.\" The woman immediately begins applying the medicine to the #yPokemon. \"I hope my friend will serve you well.\" NL You spend some time taking in the view from above, making sure to stay out of the woman's way. After you've had your fill, you leave and continue your travels.",
      "\"You don't wish to trade? I suppose I can't blame you for declining such an abrupt request.\" The woman sighs. \"I hope my apprentice will be back from Cianwood City soon . . .\" NL You decide to leave the woman to her musings."
    ],
    "OPTIONS": [
      "[Trade] ",
      "[Decline] ",
      "Lose ",
      ".",
      "Obtain ",
      "[Leave]"
    ]
  },
  "${ModID}:BlackthornGym": {
    "NAME": "Blackthorn Gym",
    "DESCRIPTIONS": [
      "Out of the corner of your eye, you see a group of suspicious-looking figures creeping away from an #yornate-looking building. Looking more closely, you recognize them as members of the infamous group of #pcriminals, Team Rocket! NL You decide to do your civil duty by beating them up and sending them flying away. As they sail away, you notice some kind of #yfang dropped on the ground.",
      "You decide to keep the fang as a reward for your vigilante justice. As you put it into your bag, you accidentally #rscratch yourself with its sharp point! #rOuch!",
      "You decide to return it to its rightful owners. You head inside the building and see a blue-haired woman looking around frantically. As her eyes hone in on you and the fang in your hands, you quickly explain what happened. NL \"Is that so? Thank you for stopping those criminals.\" The woman takes the fang from you with a smile. \"Here, take this as thanks.\" NL She hands you a pouch of #ymoney. Looks like #ggood deeds do pay off."
    ],
    "OPTIONS": [
      "[Keep it] ",
      "[Return it] ",
      "Obtain a special Relic.",
      "Become Cursed - ",
      ".",
      "Gain ",
      " Gold.",
      "[Leave]"
    ]
  },
  "${ModID}:BurnedTower": {
    "NAME": "Burned Tower",
    "DESCRIPTIONS": [
      "You stare up at the #yruins of an old building. The local legends indicate that a great tragedy had happened here long ago - you can feel the lingering #presentment and #pcurses of those that had died. You have no doubt that you could find something worthwhile in the ruins . . . but perhaps it would be more respectful to offer a prayer to the #pdeceased instead.",
      "You trudge through the derelict insides, finding a shiny #ytrinket left behind in the wreckage. As you turn to leave, you find yourself #pambushed by several #pGastlies! As you escape, you still feel their #glaughter and #psorrow echoing in your ears . . .",
      "You offer up a #yprayer for those who lost their lives in the tragedy. As you bow your head, you feel a sense of calm descend over you."
    ],
    "OPTIONS": [
      "[Search for treasure] ",
      "[Offer a prayer] ",
      "Obtain a rare Relic.",
      "Become Cursed - ",
      ".",
      "Remove a card.",
      "[Leave]"
    ]
  },
  "${ModID}:MarineLab": {
    "NAME": "MarineLab",
    "DESCRIPTIONS": [
      "You spy a small building next to the cliffside, overlooking the ocean. A sign on the building says \"Help wanted inside!\" NL You decide to heed the sign and go indoors. Inside, you spot tables filled with lab equipment and what seems to be numerous #yPokemon eggs. NL \"Are you a trainer? Thank goodness!\" A haggard-looking woman greets you. \"We recovered all these eggs from some #rpoachers, but now we need to find good homes for them . . . would you like to take one?\"",
      "You accept a #yPokemon egg. It feels warm to the touch. NL \"Take good care of it!\" NL You assure the woman that you will as you turn and leave to continue your journey.",
      "\"Oh, you want to help with my research? That would be quite helpful as well! Since I'm located so close to the ocean, all I see are marine #yPokemon, so getting to run tests on some other types of #yPokemon would be very helpful . . .\" NL You and your #yPokemon help the woman with some tests. You feel that the experiments have #ychanged you a little. For better or worse, you can't quite tell."
    ],
    "OPTIONS": [
      "[Take an egg] ",
      "[Offer to help with research] ",
      "Obtain a special Relic.",
      "Transform ",
      " cards.",
      "[Leave]"
    ]
  },
  "${ModID}:RadioTower": {
    "NAME": "News from the Radio Tower",
    "DESCRIPTIONS": [
      "You hear the sound of #yradio crackling in the distance. NL \"Ahem! Attention! The #yPokemon Research Foundation is offering - \" NL You briefly pause to listen to the broadcast. The general summary is that the foundation is willing to pay trainers to bring a variety of #yPokemon to them for research purposes. You consider if you should take them up on that.",
      "You bring one of your #yPokemon to the foundation, and the receptionist hands you the #ymoney. You feel a pang of #psadness as you leave one of your companions behind . . . but it was all for the greater good.",
      "You decide to ignore the broadcast's offer. You weren't willing to part with your companions right now."
    ],
    "OPTIONS": [
      "[Take the offer] ",
      "[Ignore it] ",
      "Lose ",
      ".",
      "Gain ",
      " Gold.",
      "[Leave]"
    ]
  },
  "${ModID}:AzaleaGym": {
    "NAME": "Azalea Gym",
    "DESCRIPTIONS": [
      "The inside of this gym contained an entire indoor #gforest, an aesthetic you certainly haven't seen before. NL \"Welcome! Are you here to challenge the gym leader? Or would you like to spectate a match?\" NL The receptionist greeted you. You considered your options . . .",
      "You decide to challenge the gym leader. As you make your way to the battlefield, you notice the #gforest around you grow #ythicker. NL \"Welcome, challenger! I am Bugsy, this gym's leader! I hope you're prepared!\" NL As the match begins, you find yourself quickly overwhelmed by your opponent's cunning tactics, hiding themselves in the trees before launching an ambush with surprising ferocity. NL After a long, hard-fought battle, you barely manage to win. As the gym leader congratulated you, you feel that you had learned how to inspire the same ferocity in your own #yPokemon.",
      "You decide to spectate one of the ongoing matches. As you watch the battle, you take note of how both trainers were making use of the surrounding terrain to their advantage, taking cover to avoid attacks and hiding in foliage to conceal their approach. You feel that you can apply the same tactic to some of your own skills."
    ],
    "OPTIONS": [
      "[Challenge] ",
      "[Spectate] ",
      "Lose ",
      " HP.",
      "Obtain ",
      ".",
      "Upgrade a card.",
      "[Leave]"
    ]
  },
  "${ModID}:DarkCave": {
    "NAME": "Dark Cave",
    "DESCRIPTIONS": [
      "Suddenly, the grounds @gives@ @way@ beneath you, sending you hurtling into the #pdarkness below you. You land with a painful #rthud, and as you groggily take in your surroundings, you find yourself in a #pdark cave. NL As you shakily get to your feet, you suddenly see #rglowing #rred #reyes staring at you from within the #pdarkness. You - ",
      "You stand your ground as a swarm of flying, biting, scratching figures hurtle past you. After a brief moment of intense #rpain, the ordeal is over. As you stumble out of the cave, you feel that you had gotten #ystronger after enduring that trial.",
      "You turn on your heel and sprint away from that swarm of #rred #reyes. You stumble and trip in the #pdarkness, but with a racing heart, you manage to make it out of the darkness. NL As you catch your breath, heart pounding out of your chest, you feel like you had several years shaved off your lifetime from that #pharrowing experience."
    ],
    "OPTIONS": [
      "[Stand your ground] ",
      "[Run away in fright] ",
      "Lose ",
      " HP.",
      " Max HP.",
      "Upgrade ",
      "Remove ",
      " cards.",
      "[Leave]"
    ]
  },
  "${ModID}:VoiceOfTheForest": {
    "NAME": "Voice of the Forest",
    "DESCRIPTIONS": [
      "You see a small #yPokemon flitting through the #gforest, being pursued by two very #rhostile-looking #yPokemon. NL \"To the left! Don't let it out of your sight!\" NL A loud voice grabs your attention, and you see a #ppoacher following close behind the pursuing #yPokemon.",
      "You stumble across the poacher's path, stealing his attention. NL \"Who are you? Get out of my way!\" NL You pretend to be a tourist lost in the woods as you ask for directions to the nearest settlement. The poacher grits his teeth as he begrudgingly stops to tell you directions. In the distance, you see his #yPokemon slow, then stop as they look around, having lost sight of their prey without their trainer's instructions. NL \"What? Blast it, where did it go?!\" NL The poacher and his #yPokemon hurry away. As you leave the forest, you suddenly find some extra #gfruit in your bag. Looks like your #ygood #ydeed didn't go unnoticed.",
      "You call out your #yPokemon and step into the pursuing #yPokemons' path. They don't even slow down as they try to bowl you over, but you manage to endure the #rpain and stand your ground long enough for your #yPokemon to take them down. The poacher, having lost his #yPokemon, quickly retreats into the distance. As you catch your breath, you see the small #yPokemon you helped float down next to you. Its wide eyes meet yours, and you feel it take an #yinterest in you."
    ],
    "OPTIONS": [
      "[Distract the poacher] ",
      "[Stop the Pokemon] ",
      "Gain ",
      " Max HP.",
      "Lose ",
      " HP.",
      "Obtain ",
      ".",
      "[Leave]"
    ]
  }
}